/*create table*/
CREATE TABLE 'books' (
  'id' int(4) NOT NULL AUTO_INCREMENT primary key,
  'name' varchar(255) NOT NULL,
  'image' text NOT NULL,
  'author' varchar(255) NOT NULL,
  'publisher' varchar(255) NOT NULL,
  'details' varchar(500),
  'price' double(5,2) not null,
  'discount_price' double(5,2) not null,
  'category' varchar(50) not null
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*insert data*/
INSERT INTO 'books'('id', 'name', 'image', 'author', 'publisher', 'details', 'price', 'discounted_price', 'category') 
VALUES (1,'Shumatsu no Warukyure 1 (Mg)','cartoon.jpg','อาจิจิกะ','PHOENIX-ฟีนิกซ์','เน้นการอธิบายเป็นขั้นเป็นตอนอย่างละเอียด ผู้อ่านจึงสามารถทำความเข้าใจได้ด้วยตัวเอง และนำไปใช้ในห้องสอบได้อย่างแท้จริง เมื่อผู้อ่านได้ศึกษาหนังสือเล่มนี้จนกระทั่งเข้าใจอย่างแท้จริง
',145.00,123.25,'การ์ตูน'),
		(2,'A pear on the throne Vol.1','novel.jpg','เทียนฉิน','แจ่มใส','โดยการเผชิญหน้ากับ 13 เทพที่แข็งแกร่งที่สุดในสวรรค์สงครามที่เดิมพันด้วยความเป็นความตายของมนุษย์กำลังจะเริ่มต้นขึ้น ณ บัดนี้
',449.00,359.20,'การ์ตูน'),
		(3,'Content revolution in the AI gen','ai.jpg','Cho Chan-soo','อมรินทร์ How to','รวบรวมงานออกแบบและบ้านที่ตกแต่งด้วยการผสมผสานตามความรู้สึกพึงพอใจ ไร้กฏเกณฑ์อย่างไม่มีขีดจำกัด เป็นไปตามรสนิยมและไลฟ์สไตล์ จนอาจไม่สามารถระบุสไตล์การตกแต่งได้อย่างเฉพาะเจาะจง เมื่อกระแสไม่ใช่เรื่องจำเป็นอีกต่อไป เราจึงเชื่อว่าการผสมผสานเพื่อให้ได้ที่อยู่อาศัยที่บ่งบอกความเป็นตัวของเราเองมากที่สุดดังตัวอย่างที่หยิบยกขึ้นมานี้เป็นแนวทางการตกแต่งแห่งยุคปัจจุบัน 
',275.00,233.75,'บริหารธุรกิจ'),
		(4,'Unique Homes','hng.jpg','ภัทริน จิตรกร','บ้านและสวน','เมื่อหน้าที่และหัวใจไม่อาจเดินบนเส้นทางเดียวกันไป๋เสวี่ยฝูจึงทำได้เพียงเก็บงำตัวตนในอดีตเสมือนว่านางกับเขาไม่เคยพบพานมาก่อน
',395.00,197.50,'บ้านและสวน'),
		(5,'PAT1 Exam math','exambook.jpg','รัชพล ธนาภากรรัตนกุล','ศูนย์หนังสือจุฬา','งานของคุณอาจหายไปเมื่อ AI ทำงานที่ใช้ความคิดสร้างสรรค์ได้เหมือนมนุษย์คนที่ปรับตัวและทำงานร่วมกับ AI เท่านั้นถึงจะอยู่รอด
',200.00,170.00,'หนังสือเตรียมสอบ'),
		(6,'The Way of the Househusband','husband.jpg','Oono Kousuke','สยามอินเตอร์คอมมิกส์ (TH)','ทัตสึคนอมตะ ยากูซ่าในตำนาน เขาคนนั้นได้ล้างมือจากการเป็นยากูซ่า ผันตัวมาเป็น "พ่อบ้านพ่อเรือน"!? ทั้งทำความสะอาด ซักผ้า จ่ายตลาด ทำกับข้าว... วันนี้ก็ขอทุ่มเทสุดตัวทำหน้าที่พ่อบ้านครับ!! เรื่องราวสุดฮาของยากูซ่าทำงานบ้าน เล่ม 1!
',60.00,54.00,'การ์ตูน');
